#include<iostream>

using namespace std;

int main() {
    // char төрлийн хаяган хувьсагч
    char *p1;
    // int төрлийг хаяган хувьсагч
    int *p2;
    // double төрлийн хаяган хувьсагч
    double *p3;

    /* гаралт: 8 8 8 
        Яагаад:
        sizeof буюу хувьсагч эсвэл өгөгдлийн төрлийн хэмжээг байтаар
        илэрхийлдэг функц. Char, int, double төрөл нь 8 byte хэмжээтэй
        учир түүнийг илтгэх хаяган хувьсагчийн санах ой дээрх хуваарилсан
        хэмжээ 8 byte байна. 
         
    */
    cout << sizeof(p1) << ' ' << sizeof(p2) << ' ' << sizeof(p3);

}