#include<iostream>

using namespace std;

int main() {

    // 5 хэмжээтэй int төрлийн массив зарласан
    int numbers[5];
    // p хаяган хувьсагч зарласан
    int *p;

    /* 
        Массивийн хувьд массивийн нэр нь түүний санайх ой дээрх эхний
        индексийн заагч байдаг учир p хаяган хувьсагчид массивийн эхний индексийн
        хаягийг оноов. Мөн түүний утгыг 10 болгов.
    */
    // Хаяг: 0x16ae17064
    p = numbers;
    *p = 10;
    /*
        Хаягийг нэгээр нэмэгдүүлэв.Бидний хувьд нэгээр нэмэгдүүлэх үйлдэл хэдий ч.
        Массивийн индекс бүр өөр өөрийн гэсэн хаягтай..Дараалалсан 2 индексийн санах ойн хаягийн зөрүү 4 байдаг.
        Нэмэгдсэний дараа: 0x16ae17068
        Хаяг дээрх утгыг мөн 1-р индексийн утгыг 20 болгов.
    */
    p++;
    *p = 20;
    /*
        p -д массивийн 2-р индексийн заагчийг оноов
        Түүнд 30 утгыг оноов. Өөрөөр 2-р индексийн утгыг 30 болгов.
    */
    p = &numbers[2];
    *p = 30;
    /*
        p-д массивийн эхний индекс дээр 3 ийг нэмсэн утгын хаягийг оноов.
        Хаяган хувьсагчийн хувьд эхний индексээс хойших 3дахь индексийн хаягийг авна.
        Түүнд 40 утга оноов.
    */
    p = numbers + 3;
    *p = 40;
    /*
        p-д массивийн эхний индексийн хаягийг оноов.
        Эхний индексээс хойших 4 дахь индексийн хаяг дээрх утгат 50 ийг оноов.
    */
    p = numbers;
    *(p + 4) = 50;

    for(int i = 0; i < 5; i++)
        cout << numbers[i] << ' ';

}