#include<iostream>

using namespace std;

int main() {
    // а нэртэй int төрөлтэй 125 утгатай хувьсагч зарласан.
    int a = 125;
    // *p хаяган хувьсагч зарлаж &a буюу а хувьсагчийн заагчийг оноосон.
    int *p = &a;

    // гаралт: 0x16b66307c энэ үед a хувьсагчийн хаяг хэвлэв.
    cout << p << '\n';
    // гаралт: 125 а хувьсагчийн хаяг дээрх утгыг хэвлэв.
    cout << *p << '\n';
    // хаяган хувьсагчийг хаягийг нэгээр нэмэгдүүлсэн.
    p++;
    // гаралт: 0x16b663080.
    cout << p << '\n';
    /* гаралт: 1805316976 учир нь 0x16b663080 хаягтай учир тухайн хаяг дээрх утга хэвлэв.
        (Санах ойгоос ямар нэгэн хог аван хэвлэв.)
    */
    cout << *p << '\n';

}