#include<iostream>

using namespace std;

// Утга солих заагч параметртэй функц
void swap(int &a, int &b) {

    // temp хувьсагчид а заагчин хувьсагчийн утгыг оноов
    int temp = a;
    // а заагчид б заагчийн утгыг оноож
    a = b;
    // хадгалж авсан а заагчийн утгыг b-д оноов
    b = temp;

}

int main() {
    // a болон б хувьсагч зарлав
    int a, b;
    // а болон б -д тус тус 4 5 утга оноов.    
    a = 4;
    b = 5;
    // Гаралт: 4 5
    cout << a << ' ' << b << '\n';
    // Заагч нь хувьсагч зарлана ap болон bp -д a болон б гийн заагчийг оноов.
    // Мөн заагч нь хувьсагчид анхны утга зайлшгүй байна.
    int &ap = a, &bp = b;
    // Заагч параметртэй утга солих функцийг дуудав.
    swap(ap, bp);
    // Гаралт: 5 4
    cout << a << ' ' << b << '\n';
}