#include<iostream>

using namespace std;

// утга солих хэрэглэгчийн функц
void swap(int *a, int *b) {

    // temp хувьсагчид хаяг оноов
    int temp = *a;
    // а-д б ийн хаягийн оноов
    *a = *b;
    // хадгалж авсан а ийн хаягийг б-д оноосноор хоёр хувьсагчийн утгыг солив
    *b = temp;

}

int main() {

    // a болон б хувьсагч зарлав
    int a, b;

    // а болон б -д тус тус 4 5 утга оноов.
    a = 4;
    b = 5;
    // Гаралт: 4 5
    cout << a << ' ' << b << '\n';
    // Хаяган хувьсагч зарлана & ашиглана хаягийг оноож өгөв
    int *ap = &a, *bp = &b;
    // Утга солих функцийг дуудаж параметрээр ap болон bp хаяган хувьсагчийг дамжуулав 
    swap(ap, bp);
    // Гаралт: 5 4
    cout << a << ' ' << b << '\n';

}